omniosorg/toolkit/Man/man8/fsrw.d.8
.TH fsrw.d 8  "$Date:: 2007-08-05 #$" "USER COMMANDS"
.SH NAME
fsrw.d \- file system read/write event tracing. Uses DTrace.
.SH SYNOPSIS
.B fsrw.d
.SH DESCRIPTION
This traces file related activity: system call reads and writes,
vnode logical read and writes (fop), and disk I/O. It can be used
to examine the behaviour of each I/O layer, from the syscall
interface to what the disk is doing. Behaviour such as read-ahead, and
max I/O size breakup can be observed.

Since this uses DTrace, only the root user or users with the
dtrace_kernel privilege can run this command.
.SH OS
Solaris
.SH STABILITY
unstable - this script uses fbt provider probes which may change for
future updates of the OS, invalidating this script. Please read
Docs/Notes/ALLfbt_notes.txt for further details about these fbt scripts.
.SH EXAMPLES
.TP
Trace file system read/write events,
# 
.B fsrw.d
.PP
.SH FIELDS
.TP
Event
traced event (see EVENTS below)
.TP
Device
device, for disk I/O
.TP
RW
either Read or Write
.TP
Size
size of I/O in bytes
.TP
Offset
offset of I/O in kilobytes
.TP
Path
path to file on disk
.PP
.SH EVENTS
.TP
sc-read
system call read
.TP
sc-write
system call write
.TP
fop_read
logical read
.TP
fop_write
logical write
.TP
disk_io
physical disk I/O
.TP
disk_ra
physical disk I/O, read ahead
.PP
.SH IDEA
Richard McDougall, Solaris Internals 2nd Ed, FS Chapter.
.PP
.SH DOCUMENTATION
See the DTraceToolkit for further documentation under the 
Docs directory. The DTraceToolkit docs may include full worked
examples with verbose descriptions explaining the output.
.SH EXIT
fsrw.d will trace until Ctrl\-C is hit. 
.SH AUTHOR
Brendan Gregg
[Sydney, Australia]
.SH SEE ALSO
fspaging.d(8), dtrace(8)
