omniosorg/toolkit/Man/man8/iopattern.8
.TH iopattern 8  "$Date:: 2007-08-05 #$" "USER COMMANDS"
.SH NAME
iopattern \- print disk I/O pattern. Uses DTrace.
.SH SYNOPSIS
.B iopattern
[\-v] [\-d device] [\-f filename] [\-m mount_point] [interval [count]]
.SH DESCRIPTION
This prints details on the I/O access pattern for the disks, such as
percentage of events that were of a random or sequential nature.
By default totals for all disks are printed.

An event is considered random when the heads seek. This program prints
the percentage of events that are random. The size of the seek is not
measured - it's either random or not.

Since this uses DTrace, only the root user or users with the
dtrace_kernel privilege can run this command.
.SH OS
Solaris
.SH STABILITY
stable - needs the io provider.
.SH OPTIONS
.TP
\-v
print timestamp, string
.TP
\-d device
instance name to snoop (eg, dad0)
.TP
\-f filename
full pathname of file to snoop
.TP
\-m mount_point
mountpoint for filesystem to snoop
.SH EXAMPLES
.TP
Default output, print I/O summary every 1 second,
# 
.B iopattern
.PP
.TP
Print 10 second samples,
# 
.B iopattern
10
.PP
.TP
Print 12 x 5 second samples,
#
.B iopattern
5 12
.PP
.TP
Snoop events on the root filesystem only,
#
.B iopattern
\-m /
.PP
.SH FIELDS
.TP
%RAN
percentage of events of a random nature
.TP
%SEQ
percentage of events of a sequential nature
.TP
COUNT
number of I/O events
.TP
MIN
minimum I/O event size
.TP
MAX
maximum I/O event size
.TP
AVG
average I/O event size
.TP
KR
total kilobytes read during sample
.TP
KW
total kilobytes written during sample
.TP
DEVICE
device name
.TP
MOUNT
mount point
.TP
FILE
filename (basename) for I/O operation
.TP
TIME
timestamp, string
.PP
.SH IDEA
Ryan Matteson
.PP
.SH DOCUMENTATION
See the DTraceToolkit for further documentation under the 
Docs directory. The DTraceToolkit docs may include full worked
examples with verbose descriptions explaining the output.
.SH EXIT
iopattern will run forever until Ctrl\-C is hit, or the
specified count is reached.
.SH AUTHOR
Brendan Gregg
[Sydney, Australia]
.SH SEE ALSO
iosnoop(8), iotop(8), dtrace(8)

