omniosorg/toolkit/Man/man8/js_calls.d.8
.TH js_calls.d 8   "$Date:: 2007-10-03 #$" "USER COMMANDS"
.SH NAME
js_calls.d - count JavaScript calls using DTrace.
.SH SYNOPSIS
.B js_calls.d

.SH DESCRIPTION
This traces activity from all browsers on the system that are
running with JavaScript provider support.

Filename and function names are printed if available.
.SH OS
Any
.SH STABILITY
Evolving - uses the DTrace JavaScript provider, which may change 
as additional features are introduced. Check JavaScript/Readme
to see what version these scripts are based on.
.SH EXAMPLES
.TP
Default output,
# 
.B js_calls.d
.PP
.SH FIELDS
.TP
FILE
Filename of the JavaScript program
.TP
TYPE
Type of call (func/obj-new/...)
.TP
NAME
Descriptive name of call
.TP
COUNT
Number of calls during sample
.PP
.SH DOCUMENTATION
See the DTraceToolkit for further documentation under the 
Examples, Notes and Docs directories. The example files may be
especially useful as they aim to demonstrate how to interpret
the output.
.SH EXIT
js_calls.d will run until Ctrl-C is hit.
.SH AUTHOR
Brendan Gregg
[CA, USA]
.SH SEE ALSO
dtrace(8)
