omniosorg/toolkit/Man/man8/pgpginbyproc.d.8
.TH pgpginbyproc.d 8  "$Date:: 2007-08-05 #$" "USER COMMANDS"
.SH NAME
pgpginbyproc.d \- pages pagedin by process name. Uses DTrace.
.SH SYNOPSIS
.B pgpginbyproc.d
.SH DESCRIPTION
pgpginbyproc.d is a DTrace OneLiner to a report the number of pages
paged in by process name.

This may be one way to help identify the process responsible for
causing heavy read traffic to the disks.

Docs/oneliners.txt and Docs/Examples/oneliners_examples.txt
in the DTraceToolkit contain this as a oneliner that can be cut-n-paste
to run.

Since this uses DTrace, only the root user or users with the
dtrace_kernel privilege can run this command.
.SH OS
Solaris
.SH STABILITY
stable - needs the vminfo provider.
.SH EXAMPLES
.TP
This samples until Ctrl\-C is hit.
# 
.B pgpginbyproc.d
.PP
.SH FIELDS
.TP
first field
The process name. There may be several PIDs that have the 
same process name, for example with numerous instances of "bash". The
value reported will be the sum of them all.
.TP
second field
The number of pages paged in
.PP
.SH DOCUMENTATION
See the DTraceToolkit for further documentation under the 
Docs directory. The DTraceToolkit docs may include full worked
examples with verbose descriptions explaining the output.
.SH EXIT
pgpginbyproc.d will sample until Ctrl\-C is hit.
.SH AUTHOR
Brendan Gregg
[Sydney, Australia]
.SH SEE ALSO
iosnoop(8), dtrace(8), truss(1)

