omniosorg/toolkit/Man/man8/rwtop.8
.TH rwtop 8  "$Date:: 2007-08-05 #$" "USER COMMANDS"
.SH NAME
rwtop \- display top read/write bytes process. Uses DTrace.
.SH SYNOPSIS
.B rwtop
[\-Cc] [\-j|\-Z] [\-n name] [\-p PID]
[\-t top] [interval [count]]
.SH DESCRIPTION
This is measuring reads and writes at the application level. 
This matches read and write system calls.

Since this uses DTrace, only the root user or users with the
dtrace_kernel privilege can run this command.
.SH OS
Solaris
.SH STABILITY
stable - needs the sysinfo provider.
.SH OPTIONS
.TP
\-C
don't clear the screen
.TP
\-c
print counts
.TP
\-j
print project ID
.TP
\-Z
print zone ID
.TP
\-n name
process name to track
.TP
\-p PID
PID to track
.TP
\-t top
print top number only
.PP
.SH EXAMPLES
.TP
Default output, print summary every 5 seconds
# 
.B rwtop
.PP
.TP
One second samples,
# 
.B rwtop
1
.TP
Print top 10 lines only,
#
.B rwtop
\-t 10
.TP
Monitor processes named "bash",
#
.B rwtop
\-n bash
.TP
Print 12 x 5 second samples, scrolling,
#
.B rwtop
\-C 5 12
.PP
.SH FIELDS
.TP
PROJ
project ID
.TP
ZONE
zone ID
.TP
UID
user ID
.TP
PID
process ID
.TP
PPID
parent process ID
.TP
CMD
command name for the process
.TP
D
direction, Read or Write
.TP
BYTES
total bytes during sample
.TP
load
1 minute load average
.TP
app_r
total read Kb for sample
.TP
app_w
total write Kb for sample
.PP
.SH DOCUMENTATION
See the DTraceToolkit for further documentation under the 
Docs directory. The DTraceToolkit docs may include full worked
examples with verbose descriptions explaining the output.
.SH EXIT
rwtop will run forever until Ctrl\-C is hit, or the specified
interval is reached.
.SH AUTHOR
Brendan Gregg
[Sydney, Australia]
.SH SEE ALSO
iotop(8), dtrace(8)

