omniosorg/toolkit/Man/man8/tcl_proccalls.d.8
.TH tcl_methodcalls.d 8   "$Date:: 2007-10-03 #$" "USER COMMANDS"
.SH NAME
tcl_methodcalls.d - count Tcl method calls DTrace.
.SH SYNOPSIS
.B tcl_methodcalls.d

.SH DESCRIPTION
This traces activity from all Tcl processes on the system with DTrace
provider support (tcl8.4.16).
.SH OS
Any
.SH STABILITY
Evolving - uses the DTrace Tcl provider, which may change 
as additional features are introduced. Check Tcl/Readme
to see what version these scripts are based on.
.SH EXAMPLES
.TP
Default output,
# 
.B tcl_methodcalls.d
.PP
.SH FIELDS
.TP
PID
Process ID
.TP
COUNT
Number of calls during sample
.TP
PROCEDURE
Tcl procedure name
.PP
.SH DOCUMENTATION
See the DTraceToolkit for further documentation under the 
Examples, Notes and Docs directories. The example files may be
especially useful as they aim to demonstrate how to interpret
the output.
.SH EXIT
tcl_methodcalls.d will run until Ctrl-C is hit.
.SH AUTHOR
Brendan Gregg
[CA, USA]
.SH SEE ALSO
dtrace(8)
